In [1]:
import pandas as pd
import numpy as np

In [2]:
file = "Book.xlsx"
pd.read_excel(file)

  Unnamed: 0  Salary   Age Department
0          A     100  20.0   Software
1          B     300  35.0         HR
2          C     150  50.0      Sales
3          D     250  45.0        NaN
4          E     300   NaN    Finance
5          G     100  25.0        Law

In [5]:
dataFrame = pd.read_excel(file)

In [7]:
newDataFrame = dataFrame.dropna()

In [9]:
newDataFrame

  Unnamed: 0  Salary   Age Department
0          A     100  20.0   Software
1          B     300  35.0         HR
2          C     150  50.0      Sales
5          G     100  25.0        Law

In [10]:
newDataFrame.to_excel(file)